# PhaseCreated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhaseCreated Property
ParameterTypeId Class See Also
---
"Phase Created"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhaseCreated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhaseCreated As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhaseCreated {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace